---
kind: method
id: M:Autodesk.Revit.DB.ElementMulticategoryFilter.#ctor(System.Collections.Generic.ICollection{Autodesk.Revit.DB.BuiltInCategory})
source: html/e43a304a-6931-7492-441c-3cac428f2431.htm
---
# Autodesk.Revit.DB.ElementMulticategoryFilter.#ctor Method

Constructs a new instance of a filter to match elements by built-in category.

## Syntax (C#)
```csharp
public ElementMulticategoryFilter(
	ICollection<BuiltInCategory> categories
)
```

## Parameters
- **categories** (`System.Collections.Generic.ICollection < BuiltInCategory >`) - The built-in categories to match.